Amiya200/stm32_water_tank/Core/Src/model_handle.c
#include "model_handle.h"
#include "relay.h"
#include "led.h"
#include "global.h"
#include "adc.h"
#include "rtc_i2c.h"
#include "uart_commands.h"

#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include <stdbool.h>
#include <stdint.h>
#include "stm32f1xx_hal.h"

/* ============================================================
   DRY-RUN POLARITY (YOU CONFIRMED)
   TRUE  → WATER PRESENT
   FALSE → DRY
   ============================================================ */

#ifndef DRY_THRESHOLD_V
#define DRY_THRESHOLD_V 0.10f
#endif

/* DRY soft-FSM timings */
#define DRY_PROBE_ON_MS   5000UL    // motor on for test (5s)
#define DRY_PROBE_OFF_MS  10000UL   // motor off between tests (10s)
#define DRY_CONFIRM_MS    1500UL    // confirm water loss before shutting down

/* General max-run protection */
static const uint32_t MAX_CONT_RUN_MS = 2UL * 60UL * 60UL * 1000UL; // 2 hours

/* ============================================================
   GLOBAL FLAGS
   ============================================================ */

extern ADC_Data adcData;
extern RTC_Time_t time;

volatile uint8_t motorStatus = 0;

volatile bool manualActive    = false;
volatile bool semiAutoActive  = false;
volatile bool countdownActive = false;
volatile bool twistActive     = false;
volatile bool searchActive    = false;
volatile bool timerActive     = false;

volatile bool senseDryRun         = false;  // TRUE = water present
volatile bool senseOverLoad       = false;
volatile bool senseOverUnderVolt  = false;
volatile bool senseMaxRunReached  = false;

/* manual override (MOTOR_ON/MOTOR_OFF manual push) */
volatile bool manualOverride = false;
volatile bool searchArmed = false;   // NEW — search configured but not yet active

/* ============================================================
   UTILS
   ============================================================ */
static inline uint32_t now_ms(void)
{
    return HAL_GetTick();
}

static inline void clear_all_modes(void)
{
    manualActive = false;
    semiAutoActive = false;
    countdownActive = false;
    twistActive = false;
    searchActive = false;
    timerActive = false;
    manualOverride = false;
}

/* ============================================================
   MOTOR CONTROL CORE
   ============================================================ */

static inline void motor_apply(bool on)
{
    Relay_Set(1, on);
    motorStatus = on ? 1 : 0;

    static uint32_t maxRunStartTick = 0;
    static bool maxRunArmed = false;

    if (on)
    {
        if (!maxRunArmed)
        {
            maxRunArmed = true;
            maxRunStartTick = now_ms();
        }
    }
    else
    {
        maxRunArmed = false;
    }

    UART_SendStatusPacket();
}

static inline void start_motor(void)
{
    motor_apply(true);
}

static inline void stop_motor_keep_modes(void)
{
    motor_apply(false);
}

bool Motor_GetStatus(void)
{
    return (motorStatus == 1U);
}

void ModelHandle_SetMotor(bool on)
{
    if (on)
    {
        clear_all_modes();
        manualOverride = true;
        start_motor();
    }
    else
    {
        clear_all_modes();
        stop_motor_keep_modes();
    }
}

/* ============================================================
   DRY SENSOR CHECK (YOU CONFIRMED LOGIC)
   TRUE  => WATER
   FALSE => DRY
   ============================================================ */
void ModelHandle_CheckDryRun(void)
{
    /* Ignore dry-run completely during countdown */
    if (countdownActive) {
        senseDryRun = true;     // force WATER PRESENT
        return;
    }

    float v = adcData.voltages[0];

    if (v <= 0.01f)
        senseDryRun = true;
    else
        senseDryRun = false;
}




/* Pure helper */
static inline bool isTankFull(void)
{
    int submerged = 0;
    for (int i = 0; i < 5; i++)
    {
        if (adcData.voltages[i] < 0.1f)
            submerged++;
    }
    return (submerged >= 4);
}

/* ============================================================
   A small safe UART status sender
   ============================================================ */
static void Safe_SendStatusPacket(void)
{
    static uint32_t last = 0;
    uint32_t now = now_ms();

    if (now - last >= 3000)
    {
        UART_SendStatusPacket();
        last = now;
    }
}
/* ============================================================
   SOFT DRY-RUN STATE MACHINE (FULLY UPDATED)
   ------------------------------------------------------------
   ============================================================ */

typedef enum {
    DRY_IDLE = 0,    // motor OFF waiting for next probe
    DRY_PROBE,       // motor ON short probe
    DRY_NORMAL       // normal running (water continuously present)
} DryFSMState;
static bool auxBurstActive = false;
static uint32_t auxBurstDeadline = 0;

static DryFSMState dryState = DRY_IDLE;
static uint32_t dryDeadline = 0;
static uint32_t dryConfirmStart = 0;
static bool dryConfirming = false;
void ModelHandle_ToggleManual(void)
{
    if (!manualActive)
    {
        clear_all_modes();
        manualActive = true;
        manualOverride = true;
        start_motor();
    }
    else
    {
        manualActive = false;
        manualOverride = false;
        stop_motor_keep_modes();
    }
}
void ModelHandle_StopAllModesAndMotor(void)
{
    clear_all_modes();
    stop_motor_keep_modes();
}
void ModelHandle_ClearManualOverride(void)
{
    manualOverride = false;
}
void ModelHandle_TriggerAuxBurst(uint16_t seconds)
{
    if (seconds == 0) seconds = 1;

    Relay_Set(2, true);
    Relay_Set(3, true);

    auxBurstActive = true;
    auxBurstDeadline = now_ms() + seconds * 1000UL;
}
void ModelHandle_ManualLongPress(void)
{
    HAL_Delay(200);
    NVIC_SystemReset();
}

/* Return TRUE if ANY mode is active */
static inline bool isAnyModeActive(void)
{
    return (manualActive ||
            semiAutoActive ||
            countdownActive ||
            twistActive ||
            searchActive ||
            timerActive);
}
void ModelHandle_SoftDryRunHandler(void)
{
    uint32_t now = now_ms();

    /* Always refresh dry-run sensor */
    ModelHandle_CheckDryRun();  // TRUE = WATER, FALSE = DRY

    /* 🔥 Do NOT run dry-run FSM when SEARCH mode is active */
    if (searchActive)
        return;

    /* Skip global dry-run if TIMER mode active */
    if (timerActive)
        return;

