Amiya200/stm32_water_tank/Core/Src/model_handle.c
    /* If no mode active → motor must be OFF */
    if (!isAnyModeActive())
    {
        stop_motor_keep_modes();
        dryState = DRY_IDLE;
        dryConfirming = false;
        return;
    }

    /* ------------------------------------------------------------
       IMPORTANT:
       If a mode (search, manual, semi-auto) wants MOTOR ON,
       we DO NOT block it here. We allow motor to turn ON first,
       then we evaluate DRY logic in NORMAL state.
       ------------------------------------------------------------ */

    switch (dryState)
    {
        /* ========================================================
           DRY_IDLE → motor OFF, waiting to check water
           ======================================================== */
        case DRY_IDLE:

            /* Keep motor OFF ONLY IF no mode wants it ON */
            if (!Motor_GetStatus())
                stop_motor_keep_modes();

            /* If water is present immediately → GO NORMAL */
            if (senseDryRun == true)  // water present
            {
                /* If any mode requested ON, keep ON */
                if (!Motor_GetStatus())
                    start_motor();

                dryState = DRY_NORMAL;
                dryConfirming = false;
                break;
            }

            /* No water → perform probe cycle */
            if ((int32_t)(dryDeadline - now) <= 0)
            {
                /* Only probe if NO mode already started motor */
                if (!Motor_GetStatus())
                    start_motor();

                dryState = DRY_PROBE;
                dryDeadline = now + DRY_PROBE_ON_MS;
                dryConfirming = false;
            }
            break;

        /* ========================================================
           DRY_PROBE → motor ON for short test interval
           ======================================================== */
        case DRY_PROBE:

            /* If water found anytime → NORMAL RUN */
            if (senseDryRun == true)
            {
                dryState = DRY_NORMAL;
                dryConfirming = false;

                /* ensure motor ON */
                if (!Motor_GetStatus())
                    start_motor();

                break;
            }

            /* Timeout & still dry → return to IDLE */
            if ((int32_t)(dryDeadline - now) <= 0)
            {
                /* Only turn OFF if mode did not force ON */
                if (!searchActive && !manualActive && !semiAutoActive)
                    stop_motor_keep_modes();

                dryState = DRY_IDLE;
                dryDeadline = now + DRY_PROBE_OFF_MS;
                dryConfirming = false;
            }
            break;

        /* ========================================================
           DRY_NORMAL → continuous run as long as water present
           ======================================================== */
        case DRY_NORMAL:

            /* Ensure motor ON (mode may force it ON) */
            if (!Motor_GetStatus())
                start_motor();

            /* Detect DRY condition */
            if (senseDryRun == false)   // DRY
            {
                if (!dryConfirming)
                {
                    dryConfirming = true;
                    dryConfirmStart = now;
                }

                /* Confirm DRY for safety duration */
                if ((int32_t)(now - dryConfirmStart) >= (int32_t)DRY_CONFIRM_MS)
                {
                    /* Stop ONLY if mode didn’t ask for ON */
                    if (!searchActive && !manualActive && !semiAutoActive)
                        stop_motor_keep_modes();

                    dryState = DRY_IDLE;
                    dryDeadline = now + DRY_PROBE_OFF_MS;
                    dryConfirming = false;
                }
            }
            else
            {
                /* Water restored → continue normally */
                dryConfirming = false;
            }
            break;
    }
}


void ModelHandle_ProcessDryRun(void)
{
    if (timerActive || countdownActive)
        return;

    ModelHandle_SoftDryRunHandler();
}

/* ============================================================
   COUNTDOWN MODE
   ------------------------------------------------------------
   Packet expected:
       @COUNTDOWN:ON:seconds#

   Fixes:
   ✔ Screen shows ON correctly
   ✔ Single run (no repeats unless you add)
   ✔ Fixed ON → REST cycle
   ✔ Stops if tank full
   ============================================================ */

volatile uint32_t countdownDuration = 0;
volatile bool countdownMode = false;
volatile uint16_t countdownRemainingRuns = 0;

static uint32_t cd_deadline_ms      = 0;
static uint32_t cd_rest_deadline_ms = 0;
static uint32_t cd_run_seconds      = 0;
static bool     cd_in_rest          = false;
static const uint32_t CD_REST_MS = 3000;   // 3 second rest

void ModelHandle_StopCountdown(void)
{
    countdownActive = false;
    countdownMode   = false;
    cd_in_rest      = false;
    countdownRemainingRuns = 0;
    countdownDuration = 0;

    stop_motor_keep_modes();
}

static void countdown_start_one_run(void)
{
    cd_deadline_ms = now_ms() + cd_run_seconds * 1000UL;
    cd_in_rest = false;
    countdownDuration = cd_run_seconds;

    start_motor();           // FIX — ensure ON status shows correctly
}

void ModelHandle_StartCountdown(uint32_t seconds)
{
    clear_all_modes();

    if (seconds == 0) {
        ModelHandle_StopCountdown();
        return;
    }

    cd_run_seconds = seconds;
    countdownRemainingRuns = 1;     // FORCE 1 RUN ONLY

    countdownActive = true;
    countdownMode   = true;

    cd_in_rest = false;
    cd_deadline_ms = now_ms() + (cd_run_seconds * 1000UL);

    countdownDuration = cd_run_seconds;
    start_motor();
}


/* tick */
static void countdown_tick(void)
{
    if (!countdownActive) return;

    uint32_t now = now_ms();

    /* Tank full safety */
    if (isTankFull()) {
        ModelHandle_StopCountdown();
        return;
    }

