Amiya200/stm32_water_tank/Core/Src/model_handle.c
    /* Still running */
    if ((int32_t)(cd_deadline_ms - now) > 0) {
        uint32_t rem = cd_deadline_ms - now;
        countdownDuration = (rem + 999U) / 1000U;
        return;
    }

    /* Time over → stop everything */
    ModelHandle_StopCountdown();
}
/* ============================================================
   TWIST MODE
   ------------------------------------------------------------
   Packet:
       @TWIST:SET:on:off#
   ============================================================ */

TwistSettings twistSettings;

static bool     twist_on_phase = false;
static uint32_t twist_deadline = 0;

void ModelHandle_StartTwist(uint16_t on_s, uint16_t off_s)
{
    clear_all_modes();

    if (on_s == 0)  on_s  = 1;
    if (off_s == 0) off_s = 1;

    twistSettings.onDurationSeconds  = on_s;
    twistSettings.offDurationSeconds = off_s;
    twistSettings.twistActive = true;
    twistActive = true;

    twist_on_phase = false;  // start in OFF phase
    twist_deadline = now_ms() + off_s * 1000UL;
}

void ModelHandle_StopTwist(void)
{
    twistSettings.twistActive = false;
    twistActive = false;
    stop_motor_keep_modes();
}

static void twist_tick(void)
{
    if (!twistActive) return;

    uint32_t now = now_ms();

    /* Phase transition */
    if ((int32_t)(twist_deadline - now) <= 0)
    {
        twist_on_phase = !twist_on_phase;

        if (twist_on_phase)
        {
            /* ON phase */
            if (senseDryRun == true)  // water present
            {
                start_motor();
            }
            else
            {
                /* dry → skip ON phase entirely */
                twist_on_phase = false;
            }
            twist_deadline = now + twistSettings.onDurationSeconds * 1000UL;
        }
        else
        {
            /* OFF phase */
            stop_motor_keep_modes();
            twist_deadline = now + twistSettings.offDurationSeconds * 1000UL;
        }
    }

    /* During ON — ensure water present */
    if (twist_on_phase)
    {
        if (senseDryRun == false)  // DRY detected
        {
            stop_motor_keep_modes();
            twist_on_phase = false;
            twist_deadline = now + twistSettings.offDurationSeconds * 1000UL;
        }
        else
        {
            if (!Motor_GetStatus())
                start_motor();
        }
    }
}
/* ============================================================
   SEARCH MODE
   ------------------------------------------------------------
   Packet:
       @SEARCH:SET:gap:probe#
   ============================================================ */

SearchSettings searchSettings;

typedef enum { SEARCH_GAP = 0, SEARCH_PROBE, SEARCH_RUN } SearchState;

static SearchState search_state = SEARCH_GAP;
static uint32_t search_deadline = 0;

void ModelHandle_StartSearch(uint16_t gap_s, uint16_t probe_s,
                             uint8_t onH, uint8_t onM,
                             uint8_t offH, uint8_t offM)
{
    clear_all_modes();

    searchArmed = true;             // only arm
    searchActive = false;           // NOT active
    searchSettings.searchActive = false;

    searchSettings.gapSeconds   = gap_s;
    searchSettings.probeSeconds = probe_s;

    searchSettings.onHour   = onH;
    searchSettings.onMinute = onM;
    searchSettings.offHour  = offH;
    searchSettings.offMinute = offM;

    search_state = SEARCH_GAP;      // idle until ON-time
}


void ModelHandle_StopSearch(void)
{
    searchSettings.searchActive = false;
    searchActive = false;
    stop_motor_keep_modes();
    search_state = SEARCH_GAP;
}

/* tick */
static void search_tick(void)
{
    uint32_t now = now_ms();

    /* -------------------------------
       ACTIVATE SEARCH ONLY AT ON-TIME
       ------------------------------- */
    if (searchArmed &&
        time.hour == searchSettings.onHour &&
        time.minutes == searchSettings.onMinute)
    {
        searchArmed = false;
        searchActive = true;
        searchSettings.searchActive = true;

        start_motor();

        search_state = SEARCH_PROBE;
        search_deadline = now + searchSettings.probeSeconds * 1000UL;
        return;
    }

    /* If not active → do nothing */
    if (!searchActive)
        return;

    /* -------------------------------
       DAY VALIDATION
       ------------------------------- */
    uint8_t dow  = time.dayofweek;       // DS3231: 1..7
    uint8_t idx  = (dow % 7);            // convert to 0..6

    if (!searchSettings.dayEnabled[idx])
    {
        stop_motor_keep_modes();
        return;
    }

    /* -------------------------------
       OFF-TIME: STOP SEARCH MODE
       ------------------------------- */
    if (time.hour == searchSettings.offHour &&
        time.minutes == searchSettings.offMinute)
    {
        stop_motor_keep_modes();
        searchActive = false;
        searchSettings.searchActive = false;
        searchArmed = false;
        search_state = SEARCH_GAP;
        return;
    }

    /* Tank full safety */
    if (isTankFull())
    {
        stop_motor_keep_modes();
        return;
    }

    /* -------------------------------
       SEARCH STATE MACHINE
       ------------------------------- */
    switch (search_state)
    {
        case SEARCH_GAP:
            stop_motor_keep_modes();

            if ((int32_t)(search_deadline - now) <= 0)
            {
                start_motor();
                search_state = SEARCH_PROBE;
                search_deadline = now + searchSettings.probeSeconds * 1000;
            }
            break;

        case SEARCH_PROBE:

            /* Water detected anytime → go RUN */
            if (senseDryRun == true)
            {
                start_motor();
                search_state = SEARCH_RUN;
                break;
            }

            /* Probe timeout → dry → gap */
            if ((int32_t)(search_deadline - now) <= 0)
            {
                stop_motor_keep_modes();
                search_state = SEARCH_GAP;
                search_deadline = now + searchSettings.gapSeconds * 1000;
            }
            break;

        case SEARCH_RUN:

            /* If dry → go to GAP */
            if (senseDryRun == false)
            {
                stop_motor_keep_modes();
                search_state = SEARCH_GAP;
                search_deadline = now + searchSettings.gapSeconds * 1000;
                break;
            }

            /* Water: motor must remain ON */
            if (!Motor_GetStatus())
                start_motor();
            break;
    }
}

/* ============================================================
   TIMER MODE — FINAL, CLEAN, FULLY FIXED VERSION
   ============================================================ */

