Amiya200/stm32_water_tank/Core/Src/model_handle.c
TimerSlot timerSlots[5];
void ModelHandle_TimerRecalculateNow(void)
{
    timerActive = false;    // default: timer OFF
    bool turnMotorOn = false;

    // Get current time
    uint8_t H = time.hour;
    uint8_t M = time.minutes;

    for (int i = 0; i < 5; i++)
    {
        if (!timerSlots[i].enabled)
            continue;

        uint8_t onH  = timerSlots[i].onHour;
        uint8_t onM  = timerSlots[i].onMinute;
        uint8_t offH = timerSlots[i].offHour;
        uint8_t offM = timerSlots[i].offMinute;

        // Convert time to minutes for easier comparison
        int nowMin  = H * 60 + M;
        int onMin   = onH * 60 + onM;
        int offMin  = offH * 60 + offM;

        // Normal slot
        if (onMin < offMin)
        {
            if (nowMin >= onMin && nowMin < offMin)
            {
                timerActive = true;
                turnMotorOn = true;
            }
        }
        else  // Overnight slot (e.g., 22:00 → 02:00)
        {
            if (nowMin >= onMin || nowMin < offMin)
            {
                timerActive = true;
                turnMotorOn = true;
            }
        }
    }

    // Apply motor decision
    if (turnMotorOn)
    {
        manualOverride = false;
        start_motor();
    }
    else
    {
        stop_motor_keep_modes();
    }
}

/* convert H:M → seconds since midnight */
static uint32_t toSec(uint8_t h, uint8_t m)
{
    return (uint32_t)h * 3600UL + (uint32_t)m * 60UL;
}

/* Set ONE slot manually (from UART or UI) */
void ModelHandle_SetTimerSlot(uint8_t slot,
                              uint8_t onH, uint8_t onM,
                              uint8_t offH, uint8_t offM)
{
    if (slot >= 5) return;

    TimerSlot* ts = &timerSlots[slot];

    ts->onHour    = onH;
    ts->onMinute  = onM;
    ts->offHour   = offH;
    ts->offMinute = offM;

    /* Auto-enable only if ON!=OFF */
    ts->enabled = !((onH == offH) && (onM == offM));
}

/* ============================================================
   Returns TRUE if ANY slot should turn the motor ON
   ============================================================ */
static bool timer_any_slot_should_run(void)
{
    RTC_GetTimeDate();  // update time struct
    uint32_t nowS = toSec(time.hour, time.minutes);

    for (int i = 0; i < 5; i++)
    {
        if (!timerSlots[i].enabled) continue;

        uint32_t on  = toSec(timerSlots[i].onHour,  timerSlots[i].onMinute);
        uint32_t off = toSec(timerSlots[i].offHour, timerSlots[i].offMinute);

        /* normal window: 10:00–14:00 */
        if (on < off)
        {
            if (nowS >= on && nowS < off)
                return true;
        }
        else
        {
            /* cross-midnight: 22:00–06:00 */
            if (nowS >= on || nowS < off)
                return true;
        }
    }

    return false;
}

/* ============================================================
   Recalculate schedule IMMEDIATELY after editing a slot
   ============================================================ */


/* ============================================================
   STOP TIMER MODE
   ============================================================ */
void ModelHandle_StopTimer(void)
{
    timerActive = false;
    stop_motor_keep_modes();
}

/* ============================================================
   START TIMER MODE
   ============================================================ */
void ModelHandle_StartTimer(void)
{
    clear_all_modes();
    timerActive = true;

    bool shouldRun = timer_any_slot_should_run();

    if (shouldRun)
        start_motor();
    else
        stop_motor_keep_modes();
}

/* ============================================================
   TIMER TICK — called in ModelHandle_Process()
   ============================================================ */
static void timer_tick(void)
{
    if (!timerActive)
        return;

    bool shouldRun = timer_any_slot_should_run();

    if (shouldRun)
    {
        if (!Motor_GetStatus())
            start_motor();
    }
    else
    {
        if (Motor_GetStatus())
            stop_motor_keep_modes();
    }
}

/* ============================================================
   SEMI AUTO
   ============================================================ */

void ModelHandle_StartSemiAuto(void)
{
    clear_all_modes();

    semiAutoActive = true;

    if (!isTankFull())
        start_motor();
}

void ModelHandle_StopSemiAuto(void)
{
    semiAutoActive = false;
    stop_motor_keep_modes();
}

static void semi_auto_tick(void)
{
    if (!semiAutoActive) return;

    /* full tank terminates mode */
    if (isTankFull())
    {
        ModelHandle_StopAllModesAndMotor();
        return;
    }

    /* stay ON */
    if (!Motor_GetStatus())
        start_motor();
}
/* ============================================================
   CENTRAL PROTECTION SYSTEM
   ============================================================ */

static void protections_tick(void)
{
    static uint32_t maxRunStart = 0;
    static bool maxRunArmed = false;

    /* Overload / UnderVoltage — immediate hard stop */
    if (senseOverLoad || senseOverUnderVolt)
    {
        ModelHandle_StopAllModesAndMotor();
        return;
    }

    /* Max continuous run time */
    if (Motor_GetStatus() && !maxRunArmed)
    {
        maxRunStart = now_ms();
        maxRunArmed = true;
    }
    else if (!Motor_GetStatus())
    {
        maxRunArmed = false;
    }

    if (maxRunArmed &&
        (now_ms() - maxRunStart) >= MAX_CONT_RUN_MS)
    {
        senseMaxRunReached = true;
        ModelHandle_StopAllModesAndMotor();
    }
}

/* ============================================================
   LED SYSTEM (updated to match your logic)
   ============================================================ */

static void leds_from_model(void)
{
    LED_ClearAllIntents();

    /* GREEN = motor ON */
    if (Motor_GetStatus())
        LED_SetIntent(LED_COLOR_GREEN, LED_MODE_STEADY, 0);

    /* GREEN BLINK = countdown active */
    if (countdownActive)
        LED_SetIntent(LED_COLOR_GREEN, LED_MODE_BLINK, 400);

