Amiya200/stm32_water_tank/Core/Src/model_handle.c
    /* RED = dry-run problem (motor wants ON but no water) */
    if (!senseDryRun && Motor_GetStatus())
        LED_SetIntent(LED_COLOR_RED, LED_MODE_STEADY, 0);

    /* BLUE = overload */
    if (senseOverLoad)
        LED_SetIntent(LED_COLOR_BLUE, LED_MODE_BLINK, 350);

    /* PURPLE = under/over voltage */
    if (senseOverUnderVolt)
        LED_SetIntent(LED_COLOR_PURPLE, LED_MODE_BLINK, 350);

    /* RED BLINK = max runtime hit */
    if (senseMaxRunReached)
        LED_SetIntent(LED_COLOR_RED, LED_MODE_BLINK, 300);

    LED_ApplyIntents();
}

/* ============================================================
   MAIN PROCESS LOOP (THE HEART OF THE SYSTEM)
   ============================================================ */

void ModelHandle_Process(void)
{
    /* -------------------------------
       1) Update dry-run input state
       ------------------------------- */
    ModelHandle_SoftDryRunHandler();

    /* -------------------------------
       2) Tick active modes
       ------------------------------- */
    if (twistActive)         twist_tick();
    if (countdownActive)     countdown_tick();
    if (searchActive)        search_tick();
    if (timerActive)         timer_tick();

    if (semiAutoActive)      semi_auto_tick();

    /* -------------------------------
       3) Protection tick
       ------------------------------- */
    protections_tick();

    /* -------------------------------
       4) LEDs update
       ------------------------------- */
    leds_from_model();

    /* -------------------------------
       5) UART: Send throttled status
       ------------------------------- */
    Safe_SendStatusPacket();
}


/* ============================================================
   UART COMMAND BRIDGE  (lightweight)
   ============================================================ */
void ModelHandle_ProcessUartCommand(const char* cmd)
{
    if (!cmd || !*cmd) return;

    /* ---------- MOTOR ---------- */
    if (strcmp(cmd, "MOTOR_ON") == 0)
    {
        ModelHandle_SetMotor(true);
    }
    else if (strcmp(cmd, "MOTOR_OFF") == 0)
    {
        ModelHandle_SetMotor(false);
    }

    /* ---------- SEMI AUTO ---------- */
    else if (strcmp(cmd, "SEMI_AUTO_START") == 0)
    {
        ModelHandle_StartSemiAuto();
    }
    else if (strcmp(cmd, "SEMI_AUTO_STOP") == 0)
    {
        ModelHandle_StopSemiAuto();
    }

    /* ---------- TWIST ---------- */
    else if (strcmp(cmd, "TWIST_START") == 0)
    {
        ModelHandle_StartTwist(
            twistSettings.onDurationSeconds,
            twistSettings.offDurationSeconds
        );
    }
    else if (strcmp(cmd, "TWIST_STOP") == 0)
    {
        ModelHandle_StopTwist();
    }

    /* ---------- SEARCH ---------- */
    else if (strcmp(cmd, "SEARCH_START") == 0)
    {
        ModelHandle_StartSearch(
            searchSettings.gapSeconds,
            searchSettings.probeSeconds,
            searchSettings.onHour,
            searchSettings.onMinute,
            searchSettings.offHour,
            searchSettings.offMinute
        );
    }

    else if (strcmp(cmd, "SEARCH_STOP") == 0)
    {
        ModelHandle_StopSearch();
    }

    /* ---------- TIMER ---------- */
    else if (strcmp(cmd, "TIMER_START") == 0)
    {
        ModelHandle_StartTimer();
    }
    else if (strcmp(cmd, "TIMER_STOP") == 0)
    {
        ModelHandle_StopTimer();
    }

    /* ---------- RESET ALL ---------- */
    else if (strcmp(cmd, "RESET_ALL") == 0)
    {
        ModelHandle_ResetAll();
    }
}
void ModelHandle_ResetAll(void)
{
    clear_all_modes();
    stop_motor_keep_modes();

    /* Reset flags */
    senseDryRun        = false;
    senseOverLoad      = false;
    senseOverUnderVolt = false;
    senseMaxRunReached = false;

    /* Reset all modes */
    countdownActive = false;
    twistActive     = false;
    searchActive    = false;
    timerActive     = false;
    semiAutoActive  = false;
    manualActive    = false;

    /* Reset mode settings */
    twistSettings.onDurationSeconds  = 5;
    twistSettings.offDurationSeconds = 5;

    searchSettings.gapSeconds   = 6;
    searchSettings.probeSeconds = 4;


    countdownDuration = 0;

    for (int i = 0; i < 5; i++)
    {
        timerSlots[i].enabled = false;
        timerSlots[i].onHour = 0;
        timerSlots[i].onMinute = 0;
        timerSlots[i].offHour = 0;
        timerSlots[i].offMinute = 0;
    }

    UART_SendStatusPacket();
}
void ModelHandle_SaveCurrentStateToEEPROM(void)
{
    static uint32_t lastWriteTick = 0;
    uint32_t now = now_ms();

    if (now - lastWriteTick < 15000U)
        return;

    static RTC_PersistState s;
    memset(&s, 0, sizeof(s));

    /* mode */
    if      (manualActive)    s.mode = 1;
    else if (semiAutoActive)  s.mode = 2;
    else if (timerActive)     s.mode = 3;
    else if (searchActive)    s.mode = 4;
    else if (countdownActive) s.mode = 5;
    else if (twistActive)     s.mode = 6;
    else                      s.mode = 0;

    s.motor = Motor_GetStatus();

    /* twist */
    s.twistOn  = twistSettings.onDurationSeconds;
    s.twistOff = twistSettings.offDurationSeconds;

    /* search (only gap + probe stored!) */
    s.searchGap   = searchSettings.gapSeconds;
    s.searchProbe = searchSettings.probeSeconds;


    /* countdown */
    s.countdownMin = countdownDuration;
    s.countdownRep = 1;

    /* Save only Timer Slot 0 */
    memcpy(&s.timerSlots[0], &timerSlots[0], sizeof(TimerSlot));

    RTC_SavePersistentState(&s);

    lastWriteTick = now;
}
